cf/Catalogs/СообщенияПользователям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СообщенияПользователям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ПользователиИнтернет</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЧерновик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрАдресаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адресация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПользователиИнтернет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/AccumulationRegisters/Лимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Лимиты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.МВЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/InformationRegisters/СрезАктивовДляСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СрезАктивовДляСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецАктива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекстПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЛимита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ПользователиИнтернет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПользователиИнтернет</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорресподентскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойАдрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаДоставкиИнтернет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательшик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатильщикЯвляетсяГрузополучателем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СайтИсточник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сайты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагиПриРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/СообщенияПользователям/Ext/ManagerModule.bsl
#Область API_стандарт

// Обязательные функции для API

Функция API_URLОбновленияНаСайте() Экспорт 		Возврат "/api/messages/update" КонецФункции
Функция API_СайтОбъекта(Ссылка) Экспорт Возврат Неопределено КонецФункции
Функция API_ПолучитьОбъект(Ссылка, ДополнительныеПараметры = Неопределено) Экспорт
	
	//  _______________________________
	// |                               |
	// |¸.•*´¨`*•.[̲̲̅̅A̲̅P̅I̲̲̅̅]¸.•*´¨`*•.|
	// |_______________________________|
	
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(Ссылка);
	
	Возврат API_ПолучитьТаблицу(Ссылки, ДополнительныеПараметры);
	
КонецФункции
Функция API_ПолучитьТаблицу(Ссылки = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	//  _______________________________
	// |                               |
	// |¸.•*´¨`*•.[̲̲̅̅A̲̅P̅I̲̲̅̅]¸.•*´¨`*•.|
	// |_______________________________|
	
	Перем Сайт, Адресат;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ДополнительныеПараметры.Свойство("Сайт", 	Сайт);
		ДополнительныеПараметры.Свойство("Адресат", Адресат); КонецЕсли;
	
	Запрос = Новый Запрос(СтрШаблон("
	|ВЫБРАТЬ 	Ссылка guid, Ответственный manager_guid, Сообщение text, ДатаСоздания date,
	|			Адресация.(Адресат user_guid) users_guid,
	|			ВЫБОР КОГДА ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.ИзменениеЛимита) 	ТОГДА 1
	|																								ИНАЧЕ 0 КОНЕЦ type
	|ИЗ 		Справочник.СообщенияПользователям
	|ГДЕ 		Не ПометкаУдаления И Не ЭтоЧерновик %1 %2 %3",
	
	?(Ссылки 	= Неопределено, "", " И Ссылка В(&Ссылки)"),
	?(Сайт 		= Неопределено, "", " И Адресация.Адресат.СайтИсточник = &Сайт"),
	?(Адресат 	= Неопределено, "", " И Адресация.Адресат = &Адресат")));
	
	Запрос.УстановитьПараметр("Ссылки",		Ссылки);
	Запрос.УстановитьПараметр("Сайт", 		Сайт);
	Запрос.УстановитьПараметр("Адресат", 	Адресат);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

Процедура СформироватьСообщенияОбИзмененияхЛимитов() Экспорт
	
	// Запросим текущим состояния лимитов сравним с текущим составим список для россылки и нафигачем сообщений на сайт
	
	Запрос = Новый Запрос("
	
	// Расчетный запрос
	
	|ВЫБРАТЬ Запрос.ФизЛицо, Спр.Ссылка ПользовательИнтернет, Сейчас, Было
	|ПОМЕСТИТЬ Таблица
	|ИЗ (
	|	ВЫБРАТЬ ФизЛицо, СУММА(Сейчас) Сейчас, СУММА(Было) Было
	|	ИЗ (
	|		ВЫБРАТЬ Инициатор ФизЛицо, СуммаОстаток Сейчас, 0 Было
	|		ИЗ	 	РегистрНакопления.Лимиты.Остатки(,Инициатор ССЫЛКА Справочник.ФизическиеЛица И Инициатор <> &пустоеФизЛицо) Ост
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ	ВладелецАктива, 0,  Остаток
	|		ИЗ		РегистрСведений.СрезАктивовДляСообщений ) Запрос
	|
	|	СГРУППИРОВАТЬ ПО ФизЛицо  
	|
	|	) Запрос
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	Справочник.ПользователиИнтернет Спр
	|ПО						Запрос.ФизЛицо = Спр.ФизЛицо
	|
	|ГДЕ НЕ Спр.ПометкаУдаления;
	
	
	// Таблица регистра сведений
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ФизЛицо ВладелецАктива, Сейчас Остаток, &текДата ДатаЗамера
	|ИЗ		Таблица
	|ГДЕ	Сейчас <> 0;
	
	// Таблица для сообщений
	
	|ВЫБРАТЬ ПользовательИнтернет, Сейчас, Было, Было - Сейчас Разница ИЗ Таблица ГДЕ Сейчас <> Было ИТОГИ МАКСИМУМ(Разница) ПО Сейчас, Было");
	
	Запрос.УстановитьПараметр("пустоеФизЛицо", 	Справочники.ФизическиеЛица.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТекДата", 		ТекущаяДата());
	Пакет = Запрос.ВыполнитьПакет();
	
	// Загрузим врегистр
	
	Набор = РегистрыСведений.СрезАктивовДляСообщений.СоздатьНаборЗаписей();
	Набор.Загрузить(Пакет[1].Выгрузить());
	
НачатьТранзакцию();

	Набор.Записать();
	
	// Теперь создадим сообщения для пользователей
	
	ВыборкаСейчас = Пакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаСейчас.Следующий() Цикл
		ВыборкаБыло = ВыборкаСейчас.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаБыло.Следующий() Цикл
			
			Если ВыборкаБыло.Разница > 0 Тогда
				
				//Текст 		= "С вашего лимита была списана сумма:&nbsp;<FONT color=#ff0000>" + ВыборкаБыло.Разница + "</FONT> руб, текущий лимит: <U><FONT color=#191970><STRONG>" + ВыборкаБыло.Сейчас + "</STRONG></FONT> руб</U>.";
				Текст 		= "С вашего лимита была списана сумма: " + ВыборкаБыло.Разница + " руб, текущий лимит: " + ВыборкаБыло.Сейчас + " руб.";
				Заголовок 	= "Лимит уменьшился на " + ВыборкаБыло.Разница + " ост: " + ВыборкаБыло.Сейчас;
				
			Иначе
				
				//Текст 		= "Ваш лимит был пополнен на сумму:&nbsp;<FONT color=#008000>" + Строка(ВыборкаБыло.Разница * -1) + "</FONT> руб, текущий лимит: <U><FONT color=#191970><STRONG>" + ВыборкаБыло.Сейчас + "</STRONG></FONT> руб</U>.";
				Текст 		= "Ваш лимит был пополнен на сумму: " + Строка(ВыборкаБыло.Разница * -1) + " руб, текущий лимит: " + ВыборкаБыло.Сейчас + " руб.";
				Заголовок 	= "Лимит увеличился на " + Строка(ВыборкаБыло.Разница * -1) + " ост: " + ВыборкаБыло.Сейчас; КонецЕсли;
			
			Если Не Справочники.СообщенияПользователям.СоздатьСообщения(
					КонвертацияТипов.ПолучитьМассивИзПоляВыборки(ВыборкаБыло.Выбрать(), "ПользовательИнтернет"),
					Перечисления.ТипыСообщений.ИзменениеЛимита, Текст, Заголовок) Тогда
						
				ОтменитьТранзакцию();
				ВызватьИсключение "Сообщения об изменении лимитов не были выполнены"; 
				
			КонецЕсли; КонецЦикла; КонецЦикла;
			
ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция СоздатьСообщения(Адресаты, ТипСообщения, Текст, Заголовок = "", Ответственный = Неопределено) Экспорт
	
	Если Не Адресаты.Количество() Тогда
		ВызватьИсключение "Некому отправлять сообщения. Не указаны адресаты";  КонецЕсли;

	Если ПустаяСтрока(Текст) Тогда
		ВызватьИсключение "Текст сообщения пустой";  КонецЕсли;
	
	СпрОбъект = Справочники.СообщенияПользователям.СоздатьЭлемент();
	СпрОбъект.ТипСообщения = ТипСообщения;
	СпрОбъект.ДатаСоздания = ТекущаяДата();
	КонвертацияТипов.ЗагрузитьМассивТаблицу(СпрОбъект.Адресация, Адресаты, "Адресат");
	
	СпрОбъект.Наименование 	= ?(Заголовок = "", Текст, Заголовок);
	СпрОбъект.Сообщение 	= Текст;
	
	СпрОбъект.Ответственный = ?(Ответственный = Неопределено, ПараметрыСеанса.ТекущийПользователь, Ответственный);
	
	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(СпрОбъект);
	
КонецФункции
